// Generated by jextract

package oracle.code.onnx.coreml.foreign;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct __darwin_arm_thread_state64 {
 *     __uint64_t __x[29];
 *     __uint64_t __fp;
 *     __uint64_t __lr;
 *     __uint64_t __sp;
 *     __uint64_t __pc;
 *     __uint32_t __cpsr;
 *     __uint32_t __pad;
 * }
 * }
 */
public class __darwin_arm_thread_state64 {

    __darwin_arm_thread_state64() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(29, coreml_provider_factory_h.C_LONG_LONG).withName("__x"),
        coreml_provider_factory_h.C_LONG_LONG.withName("__fp"),
        coreml_provider_factory_h.C_LONG_LONG.withName("__lr"),
        coreml_provider_factory_h.C_LONG_LONG.withName("__sp"),
        coreml_provider_factory_h.C_LONG_LONG.withName("__pc"),
        coreml_provider_factory_h.C_INT.withName("__cpsr"),
        coreml_provider_factory_h.C_INT.withName("__pad")
    ).withName("__darwin_arm_thread_state64");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout __x$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("__x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint64_t __x[29]
     * }
     */
    public static final SequenceLayout __x$layout() {
        return __x$LAYOUT;
    }

    private static final long __x$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint64_t __x[29]
     * }
     */
    public static final long __x$offset() {
        return __x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint64_t __x[29]
     * }
     */
    public static MemorySegment __x(MemorySegment struct) {
        return struct.asSlice(__x$OFFSET, __x$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint64_t __x[29]
     * }
     */
    public static void __x(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, __x$OFFSET, __x$LAYOUT.byteSize());
    }

    private static long[] __x$DIMS = { 29 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __uint64_t __x[29]
     * }
     */
    public static long[] __x$dimensions() {
        return __x$DIMS;
    }
    private static final VarHandle __x$ELEM_HANDLE = __x$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __uint64_t __x[29]
     * }
     */
    public static long __x(MemorySegment struct, long index0) {
        return (long)__x$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __uint64_t __x[29]
     * }
     */
    public static void __x(MemorySegment struct, long index0, long fieldValue) {
        __x$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfLong __fp$LAYOUT = (OfLong)$LAYOUT.select(groupElement("__fp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint64_t __fp
     * }
     */
    public static final OfLong __fp$layout() {
        return __fp$LAYOUT;
    }

    private static final long __fp$OFFSET = 232;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint64_t __fp
     * }
     */
    public static final long __fp$offset() {
        return __fp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint64_t __fp
     * }
     */
    public static long __fp(MemorySegment struct) {
        return struct.get(__fp$LAYOUT, __fp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint64_t __fp
     * }
     */
    public static void __fp(MemorySegment struct, long fieldValue) {
        struct.set(__fp$LAYOUT, __fp$OFFSET, fieldValue);
    }

    private static final OfLong __lr$LAYOUT = (OfLong)$LAYOUT.select(groupElement("__lr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint64_t __lr
     * }
     */
    public static final OfLong __lr$layout() {
        return __lr$LAYOUT;
    }

    private static final long __lr$OFFSET = 240;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint64_t __lr
     * }
     */
    public static final long __lr$offset() {
        return __lr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint64_t __lr
     * }
     */
    public static long __lr(MemorySegment struct) {
        return struct.get(__lr$LAYOUT, __lr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint64_t __lr
     * }
     */
    public static void __lr(MemorySegment struct, long fieldValue) {
        struct.set(__lr$LAYOUT, __lr$OFFSET, fieldValue);
    }

    private static final OfLong __sp$LAYOUT = (OfLong)$LAYOUT.select(groupElement("__sp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint64_t __sp
     * }
     */
    public static final OfLong __sp$layout() {
        return __sp$LAYOUT;
    }

    private static final long __sp$OFFSET = 248;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint64_t __sp
     * }
     */
    public static final long __sp$offset() {
        return __sp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint64_t __sp
     * }
     */
    public static long __sp(MemorySegment struct) {
        return struct.get(__sp$LAYOUT, __sp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint64_t __sp
     * }
     */
    public static void __sp(MemorySegment struct, long fieldValue) {
        struct.set(__sp$LAYOUT, __sp$OFFSET, fieldValue);
    }

    private static final OfLong __pc$LAYOUT = (OfLong)$LAYOUT.select(groupElement("__pc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint64_t __pc
     * }
     */
    public static final OfLong __pc$layout() {
        return __pc$LAYOUT;
    }

    private static final long __pc$OFFSET = 256;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint64_t __pc
     * }
     */
    public static final long __pc$offset() {
        return __pc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint64_t __pc
     * }
     */
    public static long __pc(MemorySegment struct) {
        return struct.get(__pc$LAYOUT, __pc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint64_t __pc
     * }
     */
    public static void __pc(MemorySegment struct, long fieldValue) {
        struct.set(__pc$LAYOUT, __pc$OFFSET, fieldValue);
    }

    private static final OfInt __cpsr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("__cpsr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint32_t __cpsr
     * }
     */
    public static final OfInt __cpsr$layout() {
        return __cpsr$LAYOUT;
    }

    private static final long __cpsr$OFFSET = 264;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint32_t __cpsr
     * }
     */
    public static final long __cpsr$offset() {
        return __cpsr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint32_t __cpsr
     * }
     */
    public static int __cpsr(MemorySegment struct) {
        return struct.get(__cpsr$LAYOUT, __cpsr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint32_t __cpsr
     * }
     */
    public static void __cpsr(MemorySegment struct, int fieldValue) {
        struct.set(__cpsr$LAYOUT, __cpsr$OFFSET, fieldValue);
    }

    private static final OfInt __pad$LAYOUT = (OfInt)$LAYOUT.select(groupElement("__pad"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint32_t __pad
     * }
     */
    public static final OfInt __pad$layout() {
        return __pad$LAYOUT;
    }

    private static final long __pad$OFFSET = 268;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint32_t __pad
     * }
     */
    public static final long __pad$offset() {
        return __pad$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint32_t __pad
     * }
     */
    public static int __pad(MemorySegment struct) {
        return struct.get(__pad$LAYOUT, __pad$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint32_t __pad
     * }
     */
    public static void __pad(MemorySegment struct, int fieldValue) {
        struct.set(__pad$LAYOUT, __pad$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

